```
resource "ndfc_links" "precreate" {
  source_fabric         = "CML"
  destination_fabric    = "CML"
  source_device         = "9TQYTJSZ1VJ"
  destination_device    = "9Q34PHYLDB5"
  source_interface      = "Ethernet1/1"
  destination_interface = "Ethernet1/1"
  template_name         = "int_pre_provision_intra_fabric_link"
} 
```
```
muralidm@MURALIDM-M-P76T links % terraform apply
╷
│ Warning: Provider development overrides are in effect
│ 
│ The following provider development overrides are set in the CLI configuration:
│  - cisco/ndfc in /Users/muralidm/code/go/bin
│  - ciscodevnet/nd in /Users/muralidm/code/go/bin
│  - ciscodevnet/ndfc in /Users/muralidm/code/go/bin
│ 
│ The behavior may therefore not match any released version of the provider and applying changes
│ may cause the state to become incompatible with published releases.
╵

Terraform used the selected providers to generate the following execution plan. Resource actions
are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # ndfc_links.precreate will be created
  + resource "ndfc_links" "precreate" {
      + destination_device      = "9Q34PHYLDB5"
      + destination_fabric      = "CML"
      + destination_interface   = "Ethernet1/1"
      + destination_switch_name = (known after apply)
      + is_discovered           = (known after apply)
      + is_present              = (known after apply)
      + link_params_computed    = (known after apply)
      + link_type               = (known after apply)
      + link_uuid               = (known after apply)
      + source_device           = "9TQYTJSZ1VJ"
      + source_fabric           = "CML"
      + source_interface        = "Ethernet1/1"
      + source_switch_name      = (known after apply)
      + template_name           = "int_pre_provision_intra_fabric_link"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

ndfc_links.precreate: Creating...
ndfc_links.precreate: Creation complete after 1s

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```
